# Week 13

## ipython-sql

In [ ]:
%pip install ipython-sql

In [1]:
%load_ext sql

## SQL Basics

Connect to a database

In [2]:
%%sql
sqlite:///tiny.sqlite

In [3]:
%%sql
SELECT * 
FROM sqlite_master;

 * sqlite:///tiny.sqlite
Done.

[]

In [4]:
%%sql
CREATE TABLE courses (
    course_id TEXT NOT NULL PRIMARY KEY,
    course_name TEXT, 
    credits INT );

 * sqlite:///tiny.sqlite
Done.

[]

In [5]:
%%sql
SELECT * 
FROM sqlite_master;

 * sqlite:///tiny.sqlite
Done.

[('table', 'courses', 'courses', 2, 'CREATE TABLE courses (\n    course_id TEXT NOT NULL PRIMARY KEY,\n    course_name TEXT, \n    credits INT )'),
 ('index', 'sqlite_autoindex_courses_1', 'courses', 3, None)]

In [19]:
%%sql
SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite
Done.

[]

In [20]:
%%sql 
INSERT INTO courses (course_id, course_name, credits)
VALUES ('MTH 141', 'Calculus I', 4);

 * sqlite:///tiny.sqlite
1 rows affected.

[]

In [21]:
%%sql
SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite
Done.

[('MTH 141', 'Calculus I', 4)]

In [22]:
%%sql 
INSERT INTO courses (course_id, course_name)
VALUES ('MTH 309', 'Linear Algebra');

SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite
1 rows affected.
Done.

[('MTH 141', 'Calculus I', 4), ('MTH 309', 'Linear Algebra', None)]

In [23]:
%%sql 
INSERT INTO courses (course_id, course_name)
VALUES ('MTH 309', 'Linear Algebra');

SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite

IntegrityError: (sqlite3.IntegrityError) UNIQUE constraint failed: courses.course_id
[SQL: INSERT INTO courses (course_id, course_name)
VALUES ('MTH 309', 'Linear Algebra');]
(Background on this error at: http://sqlalche.me/e/13/gkpj)

In [24]:
%%sql 
INSERT INTO courses (course_id, course_name, credits)
VALUES 
   ('MTH 142', 'Calculus II', 4),
   ('MTH 448', 'Data Oriented Computing', 4),
   ('MTH 462', 'Topics in Analysis', 2);

SELECT *
FROM courses;

 * sqlite:///tiny.sqlite
3 rows affected.
Done.

[('MTH 141', 'Calculus I', 4),
 ('MTH 309', 'Linear Algebra', None),
 ('MTH 142', 'Calculus II', 4),
 ('MTH 448', 'Data Oriented Computing', 4),
 ('MTH 462', 'Topics in Analysis', 2)]

In [26]:
%%sql
UPDATE courses
SET credits=4
WHERE course_id='MTH 309';

SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite
1 rows affected.
Done.

[('MTH 141', 'Calculus I', 4),
 ('MTH 309', 'Linear Algebra', 4),
 ('MTH 142', 'Calculus II', 4),
 ('MTH 448', 'Data Oriented Computing', 4),
 ('MTH 462', 'Topics in Analysis', 2)]

In [27]:
%%sql
DELETE FROM courses
WHERE credits < 4;

SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite
1 rows affected.
Done.

[('MTH 141', 'Calculus I', 4),
 ('MTH 309', 'Linear Algebra', 4),
 ('MTH 142', 'Calculus II', 4),
 ('MTH 448', 'Data Oriented Computing', 4)]

In [28]:
%%sql 
ALTER TABLE courses
ADD COLUMN semester;

SELECT * 
FROM courses;

 * sqlite:///tiny.sqlite
Done.
Done.

[('MTH 141', 'Calculus I', 4, None),
 ('MTH 309', 'Linear Algebra', 4, None),
 ('MTH 142', 'Calculus II', 4, None),
 ('MTH 448', 'Data Oriented Computing', 4, None)]

In [29]:
%%sql
UPDATE courses
SET semester = 'Fall'; 

SELECT * 
FROM courses

 * sqlite:///tiny.sqlite
4 rows affected.
Done.

[('MTH 141', 'Calculus I', 4, 'Fall'),
 ('MTH 309', 'Linear Algebra', 4, 'Fall'),
 ('MTH 142', 'Calculus II', 4, 'Fall'),
 ('MTH 448', 'Data Oriented Computing', 4, 'Fall')]

In [30]:
%%sql
DROP TABLE courses;

 * sqlite:///tiny.sqlite
Done.

[]

In [31]:
%%sql 
SELECT * 
FROM sqlite_master;

 * sqlite:///tiny.sqlite
Done.

[]

In [32]:
%%sql
DROP TABLE courses;

 * sqlite:///tiny.sqlite
(sqlite3.OperationalError) no such table: courses
[SQL: DROP TABLE courses;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [33]:
%%sql
DROP TABLE IF EXISTS courses;

 * sqlite:///tiny.sqlite
Done.

[]

## Queries

In [3]:
%%sql
sqlite:///gradebook_data.sqlite

In [4]:
%%sql
SELECT * 
FROM sqlite_master;

 * sqlite:///gradebook_data.sqlite
Done.

[('table', 'gradebook', 'gradebook', 4, 'CREATE TABLE "gradebook" (\n    student_id INTEGER PRIMARY KEY,\n    first_name TEXT,\n    last_name TEXT,\n    major TEXT,\n    exam1 INTEGER, \n    exam2 INTEGER, \n    exam3 INTEGER)')]

In [5]:
%%sql
SELECT * 
FROM gradebook

 * sqlite:///gradebook_data.sqlite
Done.

[(2712, 'Starr', 'Bachand', 'computer science', None, 27, 85),
 (3548, 'Marcia', 'Hinkel', 'biology', 79, 10, 41),
 (3877, 'Chu', 'Flax', 'mathematics', 72, None, 29),
 (5108, 'Shawnna', 'Coate', 'computer science', 79, 96, 61),
 (5775, 'Rosina', 'Hovey', 'biology', 96, 13, 99),
 (5787, 'Tenisha', 'Rippel', 'computer science', 27, 54, 79),
 (6245, 'Adelina', 'Brummitt', 'mathematics', None, 67, 99),
 (7138, 'Fran', 'Mount', 'biology', 71, 5, 80),
 (7256, 'Rosalinda', 'Trippe', 'computer science', None, None, 82),
 (8911, 'Lottie', 'Champine', 'computer science', None, None, 62),
 (9165, 'Ludivina', 'Hoskin', 'mathematics', 27, 55, None),
 (9346, 'Stanton', 'Mcgaugh', 'computer science', 6, 60, 40),
 (9667, 'Jonnie', 'Hillock', 'mathematics', 56, 24, 72)]

In [37]:
%%sql 
SELECT first_name, last_name, exam3
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Starr', 'Bachand', 85),
 ('Marcia', 'Hinkel', 41),
 ('Chu', 'Flax', 29),
 ('Shawnna', 'Coate', 61),
 ('Rosina', 'Hovey', 99),
 ('Tenisha', 'Rippel', 79),
 ('Adelina', 'Brummitt', 99),
 ('Fran', 'Mount', 80),
 ('Rosalinda', 'Trippe', 82),
 ('Lottie', 'Champine', 62),
 ('Ludivina', 'Hoskin', None),
 ('Stanton', 'Mcgaugh', 40),
 ('Jonnie', 'Hillock', 72)]

In [39]:
%%sql 
SELECT first_name FName, last_name LName, exam3 AS LastExam
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Starr', 'Bachand', 85),
 ('Marcia', 'Hinkel', 41),
 ('Chu', 'Flax', 29),
 ('Shawnna', 'Coate', 61),
 ('Rosina', 'Hovey', 99),
 ('Tenisha', 'Rippel', 79),
 ('Adelina', 'Brummitt', 99),
 ('Fran', 'Mount', 80),
 ('Rosalinda', 'Trippe', 82),
 ('Lottie', 'Champine', 62),
 ('Ludivina', 'Hoskin', None),
 ('Stanton', 'Mcgaugh', 40),
 ('Jonnie', 'Hillock', 72)]

In [42]:
%%sql
SELECT first_name, last_name, exam1 + exam2 + exam3 AS exam_total
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Starr', 'Bachand', None),
 ('Marcia', 'Hinkel', 130),
 ('Chu', 'Flax', None),
 ('Shawnna', 'Coate', 236),
 ('Rosina', 'Hovey', 208),
 ('Tenisha', 'Rippel', 160),
 ('Adelina', 'Brummitt', None),
 ('Fran', 'Mount', 156),
 ('Rosalinda', 'Trippe', None),
 ('Lottie', 'Champine', None),
 ('Ludivina', 'Hoskin', None),
 ('Stanton', 'Mcgaugh', 106),
 ('Jonnie', 'Hillock', 152)]

In [44]:
%%sql
SELECT first_name, last_name, exam1, COALESCE(exam1, 0) AS exam1_modified
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Starr', 'Bachand', None, 0),
 ('Marcia', 'Hinkel', 79, 79),
 ('Chu', 'Flax', 72, 72),
 ('Shawnna', 'Coate', 79, 79),
 ('Rosina', 'Hovey', 96, 96),
 ('Tenisha', 'Rippel', 27, 27),
 ('Adelina', 'Brummitt', None, 0),
 ('Fran', 'Mount', 71, 71),
 ('Rosalinda', 'Trippe', None, 0),
 ('Lottie', 'Champine', None, 0),
 ('Ludivina', 'Hoskin', 27, 27),
 ('Stanton', 'Mcgaugh', 6, 6),
 ('Jonnie', 'Hillock', 56, 56)]

In [45]:
%%sql
SELECT first_name, last_name, COALESCE(exam1, 0) + COALESCE(exam2, 0) + COALESCE(exam3, 0) AS exam_total
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Starr', 'Bachand', 112),
 ('Marcia', 'Hinkel', 130),
 ('Chu', 'Flax', 101),
 ('Shawnna', 'Coate', 236),
 ('Rosina', 'Hovey', 208),
 ('Tenisha', 'Rippel', 160),
 ('Adelina', 'Brummitt', 166),
 ('Fran', 'Mount', 156),
 ('Rosalinda', 'Trippe', 82),
 ('Lottie', 'Champine', 62),
 ('Ludivina', 'Hoskin', 82),
 ('Stanton', 'Mcgaugh', 106),
 ('Jonnie', 'Hillock', 152)]

In [47]:
%%sql
SELECT last_name || ", " || first_name AS Name, exam1, exam2, exam3
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Bachand, Starr', None, 27, 85),
 ('Hinkel, Marcia', 79, 10, 41),
 ('Flax, Chu', 72, None, 29),
 ('Coate, Shawnna', 79, 96, 61),
 ('Hovey, Rosina', 96, 13, 99),
 ('Rippel, Tenisha', 27, 54, 79),
 ('Brummitt, Adelina', None, 67, 99),
 ('Mount, Fran', 71, 5, 80),
 ('Trippe, Rosalinda', None, None, 82),
 ('Champine, Lottie', None, None, 62),
 ('Hoskin, Ludivina', 27, 55, None),
 ('Mcgaugh, Stanton', 6, 60, 40),
 ('Hillock, Jonnie', 56, 24, 72)]

In [49]:
%%sql
SELECT first_name, last_name, exam3,
CASE 
    WHEN exam3 > 90 THEN 'A'
    WHEN exam3 > 80 THEN 'B'
    WHEN exam3 > 70 THEN 'C'
    WHEN exam3 > 60 THEN 'D'
    ELSE 'F'
END AS letter_grade
FROM gradebook;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Starr', 'Bachand', 85, 'B'),
 ('Marcia', 'Hinkel', 41, 'F'),
 ('Chu', 'Flax', 29, 'F'),
 ('Shawnna', 'Coate', 61, 'D'),
 ('Rosina', 'Hovey', 99, 'A'),
 ('Tenisha', 'Rippel', 79, 'C'),
 ('Adelina', 'Brummitt', 99, 'A'),
 ('Fran', 'Mount', 80, 'C'),
 ('Rosalinda', 'Trippe', 82, 'B'),
 ('Lottie', 'Champine', 62, 'D'),
 ('Ludivina', 'Hoskin', None, 'F'),
 ('Stanton', 'Mcgaugh', 40, 'F'),
 ('Jonnie', 'Hillock', 72, 'C')]

### WHERE

In [54]:
%%sql
SELECT * 
FROM gradebook
WHERE exam1 > 70 AND NOT exam3 > 70;

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[(3548, 'Marcia', 'Hinkel', 'biology', 79, 10, 41),
 (3877, 'Chu', 'Flax', 'mathematics', 72, None, 29),
 (5108, 'Shawnna', 'Coate', 'computer science', 79, 96, 61)]

In [55]:
%%sql 
SELECT * 
FROM gradebook
WHERE exam1 = NULL

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[]

In [56]:
%%sql 
SELECT * 
FROM gradebook
WHERE exam1 IS NULL

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[(2712, 'Starr', 'Bachand', 'computer science', None, 27, 85),
 (6245, 'Adelina', 'Brummitt', 'mathematics', None, 67, 99),
 (7256, 'Rosalinda', 'Trippe', 'computer science', None, None, 82),
 (8911, 'Lottie', 'Champine', 'computer science', None, None, 62)]

In [57]:
%%sql 
SELECT * 
FROM gradebook
WHERE exam1 IS NOT NULL

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[(3548, 'Marcia', 'Hinkel', 'biology', 79, 10, 41),
 (3877, 'Chu', 'Flax', 'mathematics', 72, None, 29),
 (5108, 'Shawnna', 'Coate', 'computer science', 79, 96, 61),
 (5775, 'Rosina', 'Hovey', 'biology', 96, 13, 99),
 (5787, 'Tenisha', 'Rippel', 'computer science', 27, 54, 79),
 (7138, 'Fran', 'Mount', 'biology', 71, 5, 80),
 (9165, 'Ludivina', 'Hoskin', 'mathematics', 27, 55, None),
 (9346, 'Stanton', 'Mcgaugh', 'computer science', 6, 60, 40),
 (9667, 'Jonnie', 'Hillock', 'mathematics', 56, 24, 72)]

In [59]:
%%sql
SELECT * 
FROM gradebook
WHERE last_name LIKE 'H%e%'

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[(3548, 'Marcia', 'Hinkel', 'biology', 79, 10, 41),
 (5775, 'Rosina', 'Hovey', 'biology', 96, 13, 99)]

## ORDER BY

In [60]:
%%sql
SELECT first_name, last_name, exam3
FROM gradebook
ORDER BY exam3

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Ludivina', 'Hoskin', None),
 ('Chu', 'Flax', 29),
 ('Stanton', 'Mcgaugh', 40),
 ('Marcia', 'Hinkel', 41),
 ('Shawnna', 'Coate', 61),
 ('Lottie', 'Champine', 62),
 ('Jonnie', 'Hillock', 72),
 ('Tenisha', 'Rippel', 79),
 ('Fran', 'Mount', 80),
 ('Rosalinda', 'Trippe', 82),
 ('Starr', 'Bachand', 85),
 ('Rosina', 'Hovey', 99),
 ('Adelina', 'Brummitt', 99)]

In [62]:
%%sql
SELECT first_name, last_name, exam3
FROM gradebook
ORDER BY exam3 DESC

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Rosina', 'Hovey', 99),
 ('Adelina', 'Brummitt', 99),
 ('Starr', 'Bachand', 85),
 ('Rosalinda', 'Trippe', 82),
 ('Fran', 'Mount', 80),
 ('Tenisha', 'Rippel', 79),
 ('Jonnie', 'Hillock', 72),
 ('Lottie', 'Champine', 62),
 ('Shawnna', 'Coate', 61),
 ('Marcia', 'Hinkel', 41),
 ('Stanton', 'Mcgaugh', 40),
 ('Chu', 'Flax', 29),
 ('Ludivina', 'Hoskin', None)]

## LIMIT

In [63]:
%%sql 
SELECT first_name, last_name, exam3
FROM gradebook
ORDER BY exam3 DESC
LIMIT 5

 * sqlite:///gradebook_data.sqlite
   sqlite:///tiny.sqlite
Done.

[('Rosina', 'Hovey', 99),
 ('Adelina', 'Brummitt', 99),
 ('Starr', 'Bachand', 85),
 ('Rosalinda', 'Trippe', 82),
 ('Fran', 'Mount', 80)]